# New Section

In [ ]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.1)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('test').getOrCreate()

In [ ]:
df = spark.read.csv('/content/TTTTTTT.csv')

In [ ]:
df.head(10)

[Row(_c0='Name', _c1='Age', _c2='Location', _c3='Mark'),
 Row(_c0='A', _c1='16', _c2='Noida', _c3='50'),
 Row(_c0='I', _c1='17', _c2='Dehli', _c3='51'),
 Row(_c0='P', _c1='18', _c2='UP', _c3='52'),
 Row(_c0='K', _c1='19', _c2='JK', _c3='53'),
 Row(_c0='P', _c1='20', _c2='AP', _c3='54'),
 Row(_c0='M', _c1='21', _c2='M', _c3='55'),
 Row(_c0='N', _c1='22', _c2='N', _c3='56'),
 Row(_c0='M', _c1='23', _c2='M', _c3='57')]

In [ ]:
df.show()

+----+---+--------+----+
| _c0|_c1|     _c2| _c3|
+----+---+--------+----+
|Name|Age|Location|Mark|
|   A| 16|   Noida|  50|
|   I| 17|   Dehli|  51|
|   P| 18|      UP|  52|
|   K| 19|      JK|  53|
|   P| 20|      AP|  54|
|   M| 21|       M|  55|
|   N| 22|       N|  56|
|   M| 23|       M|  57|
+----+---+--------+----+

In [ ]:
df.columns

['_c0', '_c1', '_c2', '_c3']

In [ ]:
#column name select
df.select(['_c0', '_c1']).show()

+----+---+
| _c0|_c1|
+----+---+
|Name|Age|
|   A| 16|
|   I| 17|
|   P| 18|
|   K| 19|
|   P| 20|
|   M| 21|
|   N| 22|
|   M| 23|
+----+---+

In [ ]:
#drop
df.drop('_c3').show()

+----+---+--------+
| _c0|_c1|     _c2|
+----+---+--------+
|Name|Age|Location|
|   A| 16|   Noida|
|   I| 17|   Dehli|
|   P| 18|      UP|
|   K| 19|      JK|
|   P| 20|      AP|
|   M| 21|       M|
|   N| 22|       N|
|   M| 23|       M|
+----+---+--------+

In [ ]:
#column Rename
df.withColumnRenamed('_c0','id').show()

+----+---+--------+----+
|  id|_c1|     _c2| _c3|
+----+---+--------+----+
|Name|Age|Location|Mark|
|   A| 16|   Noida|  50|
|   I| 17|   Dehli|  51|
|   P| 18|      UP|  52|
|   K| 19|      JK|  53|
|   P| 20|      AP|  54|
|   M| 21|       M|  55|
|   N| 22|       N|  56|
|   M| 23|       M|  57|
+----+---+--------+----+

In [ ]:
#Create a spark Session
data=[('John',28), ('Alica',33), ('Bob',35)]
columns=['Name','Age']
df=spark.createDataFrame(data, columns)
df.show()

+-----+---+
| Name|Age|
+-----+---+
| John| 28|
|Alica| 33|
|  Bob| 35|
+-----+---+

In [ ]:
#user filter select row
df.filter(df.Age>30).show()

+-----+---+
| Name|Age|
+-----+---+
|Alica| 33|
|  Bob| 35|
+-----+---+

In [ ]:
#check data type column
df.printSchema()

root
 |-- Name: string (nullable = true)
 |-- Age: long (nullable = true)

In [ ]:
data = [('Alica','Sales',1000),('Bob','Sales',1500),('Charlie','IT',2000), ('David','IT',2200),('Eve','HR',1200)]
columns = ['Name','Department','Salary']
df = spark.createDataFrame(data, columns)
df.show()

+-------+----------+------+
|   Name|Department|Salary|
+-------+----------+------+
|  Alica|     Sales|  1000|
|    Bob|     Sales|  1500|
|Charlie|        IT|  2000|
|  David|        IT|  2200|
|    Eve|        HR|  1200|
+-------+----------+------+

In [ ]:
#group by department salary sum
df.groupBy('Department').sum('Salary').alias('Total Salary').show()

+----------+-----------+
|Department|sum(Salary)|
+----------+-----------+
|     Sales|       2500|
|        HR|       1200|
|        IT|       4200|
+----------+-----------+

In [ ]:
from pyspark.sql.functions import sum
df.groupBy('Department').agg(sum('Salary').alias('Total_Salary')).show()

+----------+------------+
|Department|Total_Salary|
+----------+------------+
|     Sales|        2500|
|        HR|        1200|
|        IT|        4200|
+----------+------------+